zad6/app/controllers/products_controller.rb

  def index
    @customer = Customer.find(params[:customer_id])
    @products = @customer.products.order(price: :desc).includes(:categories)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (?, ?, ?)  [["id", 1], ["id", 3], ["id", 2]]
SELECT "products".* FROM "products" WHERE "products"."customer_id" = ? ORDER BY "products"."price" DESC  [["customer_id", 1]]