zad4/app/controllers/teams_controller.rb

  def index
    players = Player.order("random()").where(captain: false).first(20)
    captains = Player.order("random()").where(captain: true).first(2)
    @team1, @team2 = players.each_slice(10).to_a
    @team1.unshift(captains.first)
---
SELECT  "players".* FROM "players" WHERE NOT (captain) ORDER BY random() LIMIT ?  [["LIMIT", 20]]
SELECT  "players".* FROM "players" WHERE (captain) ORDER BY random() LIMIT ?  [["LIMIT", 2]]